; domain
(define (domain depotprob1818-domain)
 (:requirements :strips :typing :numeric-fluents)
 (:types
    place locatable - object
    truck hoist surface - locatable
    pallet crate - surface
    depot distributor - place
 )
 (:predicates (at_ ?x - locatable ?y - place) (on ?x_0 - crate ?y_0 - surface) (in ?x_0 - crate ?y_1 - truck) (lifting ?x_1 - hoist ?y_2 - crate) (available ?x_1 - hoist) (clear ?x_2 - surface))
 (:functions (load_limit ?t - truck) (current_load ?t - truck) (weight ?c - crate) (fuel_cost))
 (:action drive
  :parameters ( ?x_3 - truck ?y - place ?z - place)
  :precondition (and (at_ ?x_3 ?y))
  :effect (and (not (at_ ?x_3 ?y)) (at_ ?x_3 ?z) (increase (fuel_cost) 10)))
 (:action lift
  :parameters ( ?x_1 - hoist ?y_2 - crate ?z_0 - surface ?p - place)
  :precondition (and (at_ ?x_1 ?p) (available ?x_1) (at_ ?y_2 ?p) (on ?y_2 ?z_0) (clear ?y_2))
  :effect (and (not (at_ ?y_2 ?p)) (lifting ?x_1 ?y_2) (not (clear ?y_2)) (not (available ?x_1)) (clear ?z_0) (not (on ?y_2 ?z_0)) (increase (fuel_cost) 1)))
 (:action drop
  :parameters ( ?x_1 - hoist ?y_2 - crate ?z_0 - surface ?p - place)
  :precondition (and (at_ ?x_1 ?p) (at_ ?z_0 ?p) (clear ?z_0) (lifting ?x_1 ?y_2))
  :effect (and (available ?x_1) (not (lifting ?x_1 ?y_2)) (at_ ?y_2 ?p) (not (clear ?z_0)) (clear ?y_2) (on ?y_2 ?z_0)))
 (:action load
  :parameters ( ?x_1 - hoist ?y_2 - crate ?z_1 - truck ?p - place)
  :precondition (and (at_ ?x_1 ?p) (at_ ?z_1 ?p) (lifting ?x_1 ?y_2) (<= (+ (weight ?y_2) (current_load ?z_1)) (load_limit ?z_1)))
  :effect (and (not (lifting ?x_1 ?y_2)) (in ?y_2 ?z_1) (available ?x_1) (increase (current_load ?z_1) (weight ?y_2))))
 (:action unload
  :parameters ( ?x_1 - hoist ?y_2 - crate ?z_1 - truck ?p - place)
  :precondition (and (at_ ?x_1 ?p) (at_ ?z_1 ?p) (available ?x_1) (in ?y_2 ?z_1))
  :effect (and (not (in ?y_2 ?z_1)) (not (available ?x_1)) (lifting ?x_1 ?y_2) (decrease (current_load ?z_1) (weight ?y_2))))
)

; problem
(define (problem depotprob1818-problem)
 (:domain depotprob1818-domain)
 (:objects
   depot0 - depot
   distributor0 distributor1 - distributor
   truck0 truck1 - truck
   hoist0 hoist1 hoist2 - hoist
   pallet0 pallet1 pallet2 - pallet
   crate0 crate1 - crate
 )
 (:init (at_ pallet0 depot0) (clear crate1) (at_ pallet1 distributor0) (clear crate0) (at_ pallet2 distributor1) (clear pallet2) (at_ truck0 distributor1) (= (current_load truck0) 0) (= (load_limit truck0) 323) (at_ truck1 depot0) (= (current_load truck1) 0) (= (load_limit truck1) 220) (at_ hoist0 depot0) (available hoist0) (at_ hoist1 distributor0) (available hoist1) (at_ hoist2 distributor1) (available hoist2) (at_ crate0 distributor0) (on crate0 pallet1) (= (weight crate0) 11) (at_ crate1 depot0) (on crate1 pallet0) (= (weight crate1) 86) (= (fuel_cost) 0))
 (:goal (and (on crate0 pallet2) (on crate1 pallet1)))
 (:metric minimize (fuel_cost))
)

; plan
1. (lift hoist1 crate0 pallet1 distributor0)
   deleted: (at_ crate0 distributor0) (clear crate0) (available hoist1) (on crate0 pallet1)
   added: (lifting hoist1 crate0) (clear pallet1)
   changed: (fuel_cost) from 0 to 1
   goals met: 0 of 2
2. (lift hoist0 crate1 pallet0 depot0)
   deleted: (at_ crate1 depot0) (clear crate1) (available hoist0) (on crate1 pallet0)
   added: (lifting hoist0 crate1) (clear pallet0)
   changed: (fuel_cost) from 1 to 2
   goals met: 0 of 2
3. (drive truck0 distributor1 distributor0)
   deleted: (at_ truck0 distributor1)
   added: (at_ truck0 distributor0)
   changed: (fuel_cost) from 2 to 12
   goals met: 0 of 2
4. (load hoist0 crate1 truck1 depot0)
   deleted: (lifting hoist0 crate1)
   added: (in crate1 truck1) (available hoist0)
   changed: (current_load truck1) from 0 to 86
   goals met: 0 of 2
5. (drive truck1 depot0 distributor0)
   deleted: (at_ truck1 depot0)
   added: (at_ truck1 distributor0)
   changed: (fuel_cost) from 12 to 22
   goals met: 0 of 2
6. (load hoist1 crate0 truck0 distributor0)
   deleted: (lifting hoist1 crate0)
   added: (in crate0 truck0) (available hoist1)
   changed: (current_load truck0) from 0 to 11
   goals met: 0 of 2
7. (drive truck0 distributor0 distributor1)
   deleted: (at_ truck0 distributor0)
   added: (at_ truck0 distributor1)
   changed: (fuel_cost) from 22 to 32
   goals met: 0 of 2
8. (unload hoist1 crate1 truck1 distributor0)
   deleted: (in crate1 truck1) (available hoist1)
   added: (lifting hoist1 crate1)
   changed: (current_load truck1) from 86 to 0
   goals met: 0 of 2
9. (drive truck1 distributor0 distributor0)
   changed: (fuel_cost) from 32 to 42
   goals met: 0 of 2
10. (unload hoist2 crate0 truck0 distributor1)
   deleted: (in crate0 truck0) (available hoist2)
   added: (lifting hoist2 crate0)
   changed: (current_load truck0) from 11 to 0
   goals met: 0 of 2
11. (drop hoist1 crate1 pallet1 distributor0)
   deleted: (lifting hoist1 crate1) (clear pallet1)
   added: (available hoist1) (at_ crate1 distributor0) (clear crate1) (on crate1 pallet1)
   goals met: 1 of 2
12. (drive truck0 distributor1 distributor0)
   deleted: (at_ truck0 distributor1)
   added: (at_ truck0 distributor0)
   changed: (fuel_cost) from 42 to 52
   goals met: 1 of 2
13. (drop hoist2 crate0 pallet2 distributor1)
   deleted: (lifting hoist2 crate0) (clear pallet2)
   added: (available hoist2) (at_ crate0 distributor1) (clear crate0) (on crate0 pallet2)
   goals met: 2 of 2
